Question 1

In [5]:
a = 0

def b():
    global a
    a = c(a)

def c(a):
    return a + 2


b()
b()
b()
print(a)

6

The value displayed when evaluating a after three calls to b() is 6.

- Initial value of a is 0.
- After the first call to b(), a becomes 2.
- After the second call to b(), a becomes 4.
- After the third call to b(), a becomes 6.
Therefore, the final value of a is 6.

Question 2

In [95]:
def fileLength(file_name):
    try:
     
        with open(file_name, 'r') as file:
            contents = file.read()
            print(len(contents))
    except FileNotFoundError:
      
        print(f"File {file_name} not found.")

In [97]:
fileLength('midterm.py')  
fileLength('idterm.py')

File midterm.py not found.
File idterm.py not found.

Question 3

In [11]:
class Marsupial:
    def __init__(self):
       
        self.pouch = []

    def put_in_pouch(self, item):
        
        self.pouch.append(item)

    def pouch_contents(self):
       
        return self.pouch

In [13]:
class Kangaroo(Marsupial):
    def __init__(self, x, y):
        
        super().__init__()
      
        self.x = x
        self.y = y

    def jump(self, dx, dy):
  
        self.x += dx
        self.y += dy

    def __str__(self):
     
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

In [15]:

m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
print(m.pouch_contents()) 


k = Kangaroo(0, 0)
print(k) 
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents()) 
k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)

['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

Question 4

In [17]:
def collatz(x):

    print(x)
    
    if x == 1:
        return
    
    elif x % 2 == 0:
        collatz(x // 2)
 
    else:
        collatz(3 * x + 1)

In [19]:
collatz(1)
print("---")
collatz(10)

1
---
10
5
16
8
4
2
1

Question 5

In [27]:
def binary(n):

    if n < 2:
        print(n, end="") 
    else:
        
        binary(n // 2)
       
        print(n % 2, end="")

In [23]:
binary(0)
print()
binary(1)
print()
binary(3)
print()
binary(9)
print()

0
1
11
1001

In [49]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.current_level = None 

    def handle_starttag(self, tag, attrs):
       
        if tag in ["h1", "h2", "h3", "h4", "h5", "h6"]:
          
            self.current_level = int(tag[1])

    def handle_data(self, data):
   
        if self.current_level is not None:
            print(" " * (self.current_level - 1) + data.strip())

    def handle_endtag(self, tag):
       
        if tag in ["h1", "h2", "h3", "h4", "h5", "h6"]:
            self.current_level = None

In [51]:
infile = open('w3c.html.txt')
content = infile.read()
infile.close()

hp = HeadingParser()
hp.feed(content)

W3C Mission
 Principles

Question 7

In [135]:
import requests
from bs4 import BeautifulSoup

def webdir(url, depth, indent):
    
    if depth < 0:
        return
    
  
    print(" " * indent + url)
    
    
    headers = {'User-Agent': 'Mozilla/5.0'}
    
    try:
        
        response = requests.get(url, headers=headers)
        response.raise_for_status()  
        
       
        soup = BeautifulSoup(response.text, 'html.parser')
    except requests.exceptions.RequestException as e:
        print(" " * indent + f"Error accessing {url}: {e}")
        return
    
   
    if depth > 0:
        for link in soup.find_all('a', href=True):
            next_url = link['href']
            
            if not next_url.startswith('http'):
                next_url = requests.compat.urljoin(url, next_url)
            
            
            webdir(next_url, depth - 1, indent + 2)


webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/csc242/test1.html
Error accessing http://reed.cs.depaul.edu/lperkovic/csc242/test1.html: 404 Client Error:  for url: http://reed.cs.depaul.edu/lperkovic/csc242/test1.html

Question 8

In [103]:
import sqlite3
import pandas as pd


conn = sqlite3.connect(':memory:')
cursor = conn.cursor()


cursor.execute('''
    CREATE TABLE Weather (
        City TEXT,
        Country TEXT,
        Season TEXT,
        Temperature REAL,
        Rainfall REAL
    )
''')


data = [
    ('Mumbai', 'India', 'Winter', 24.8, 5.9),
    ('Mumbai', 'India', 'Spring', 28.4, 16.2),
    ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
    ('Mumbai', 'India', 'Fall', 27.6, 346.0),
    ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
    ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
    ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
    ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
    ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
    ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
    ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
    ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)
]
cursor.executemany('INSERT INTO Weather VALUES (?, ?, ?, ?, ?)', data)
conn.commit()

a) Temperature Data

In [101]:
query_a = 'SELECT Temperature FROM Weather'
pd.read_sql_query(query_a, conn)

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

b) All Cities without repetition

In [105]:
query_b = 'SELECT DISTINCT City FROM Weather'
pd.read_sql_query(query_b, conn)

     City
0  Mumbai
1  London
2   Cairo

c) All record of India

In [107]:
query_c = 'SELECT * FROM Weather WHERE Country = "India"'
pd.read_sql_query(query_c, conn)

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

d) All the fall records

In [109]:
query_d = 'SELECT * FROM Weather WHERE Season = "Fall"'
pd.read_sql_query(query_d, conn)

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters

In [111]:
query_e = 'SELECT City, Country, Season FROM Weather WHERE Rainfall BETWEEN 200 AND 400'
pd.read_sql_query(query_e, conn)

     City         Country  Season
0  Mumbai           India    Fall
1  London  United Kingdom  Winter
2  London  United Kingdom    Fall

f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [113]:
query_f = 'SELECT City, Country FROM Weather WHERE Season = "Fall" AND Temperature > 20 ORDER BY Temperature ASC'
pd.read_sql_query(query_f, conn)

     City Country
0   Cairo   Egypt
1  Mumbai   India

g) The total annual rainfall for Cairo.

In [115]:
query_g = 'SELECT SUM(Rainfall) AS Total_Annual_Rainfall FROM Weather WHERE City = "Cairo"'
pd.read_sql_query(query_g, conn)

   Total_Annual_Rainfall
0                   27.6

h) The total rainfall for each season.

In [117]:
query_h = 'SELECT Season, SUM(Rainfall) AS Total_Rainfall FROM Weather GROUP BY Season'
pd.read_sql_query(query_h, conn)

   Season  Total_Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

Question 9

In [119]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

a) Converted to uppercase

In [121]:
a = [word.upper() for word in words]
print(a)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

b) Converted to lowercase

In [123]:
b = [word.lower() for word in words]
print(b)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

c) List of lengths of each word

In [125]:
c = [len(word) for word in words]
print(c)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

d) List containing each word in uppercase, lowercase, and its length

In [127]:
d = [[word.upper(), word.lower(), len(word)] for word in words]
print(d)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

e) List of words containing 4 or more characters

In [129]:
e = [word for word in words if len(word) >= 4]
print(e)

['quick', 'brown', 'jumps', 'over', 'lazy']